/*
BoardService3
    - 내용 [String타입] 과 작성자 [String타입] 과 비밀번호 [int타입]으로 게시물 클래스를 설계
    - 게시물 객체 최대 100개 까지 저장하는 서비스 구축
        - 조건 : main함수 1개 와 배열은 최대1까지 사용하여 구현
        - 구축 : 게시물 쓰기 와 게시물 출력 기능 구현

        타입 : 데이터 형태를 분류한거
            대분류 : - 기본타입(byte,int,short,long,float,double,char,boolean)8개,
                    - 참조타입 ( []배열, 클래스 , 인터페이스 , 열거타입 ) 등등
        클래스 : 타입 만들기 - 멤버변수(필드) , 생성자 , 메소드(멤버함수) 로 구성된 새로운 타입 만들기
            - 객체지향 프로그래밍 매우 중요한 문법
        객체 : 하나의 자료(여러개 자료들을 주소값)을 저장하는 메모리 공간( JVM 힙영역 )
            - (참조)클래스 타입으로 생성된 메모리 공간
        변수 : 하나의 자료(실제값,주소값)를 저장하는 메모리 공간 ( JVM 스택 영역 )
            - 기본/참조 타입으로 생성된 메모리 공간














 */






package day22;


import java.util.Scanner;

public class BoardService3 {

}
